print ("Добрый день! Скажите свой возраст.")

Ages = int(input("Введите свой возраст: "))

if Ages < 12:
    print ("Проходите. Для вас вход бесплатный")
    exit()
elif Ages >= 18:
    print ("Вам придется заплатить за билет полную стоимость.")
    exit()
else: 
    CheckEskort = str(input("Прекрасно! Вы сегодня с сопровождением? (Введите да или нет)"))
    if CheckEskort == "да" and Ages < 18:
        print ("Мы сделаем для вас скидку.")
    else:
        print ("Вам придется заплатить за билет полную стоимость.")
    


